[
    {
        "type": "text",
        "text": "Разработка генератора платформенно-зависимой модели для системы проектирования виртуальных помощников ",
        "text_level": 1,
        "bbox": [
            114,
            87,
            882,
            135
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Никита Допиро1 ",
        "bbox": [
            116,
            148,
            264,
            166
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "1 Иркутский национальный исследовательский технический университет, ул. Лермонтова 83, г. Иркутск, 664033, Россия ",
        "bbox": [
            114,
            179,
            882,
            207
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Аннотация ",
        "text_level": 1,
        "bbox": [
            210,
            220,
            304,
            233
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "В данной статье будет рассмотрена разработка генератора платформенно-зависимой модели для системы проектирования виртуальных помощников на базе JUST AI c использованием платформы JAICP с помощью MDA подхода. ",
        "bbox": [
            210,
            236,
            880,
            280
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Ключевые слова ",
        "text_level": 1,
        "bbox": [
            210,
            295,
            351,
            307
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "MDA, виртуальный помощник, чат-бот, JAICP, искусственный интеллект ",
        "bbox": [
            210,
            309,
            774,
            325
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "1. Введение ",
        "text_level": 1,
        "bbox": [
            116,
            357,
            252,
            374
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Искусственный интеллект уже давно стал неотъемлемой частью нашей повседневной жизни. Одним из наиболее популярных применений ИИ являются виртуальные помощники – это сервис, способный взаимодействовать с людьми на основе уже имеющегося сценария, выполнять различные задачи и предоставлять необходимую информацию. В большинстве современных устройствах уже есть голосовой помощник, способный предоставить информацию о погоде, вызвать такси, заказать еду. ",
        "bbox": [
            112,
            391,
            882,
            482
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Алгоритм работы виртуального помощника [1], [2] включает в себя следующие этапы: принятие и распознавание голосового ввода; преобразование его в текстовый формат; обработка уже имеющегося текста на естественном языке; определение намерений пользователя; выявление задачи, ее параметров и определение дальнейших шагов решения; выполнение этапов решения выявленной задачи; создание ответа в виде диалога и представление результата пользователю. ",
        "bbox": [
            112,
            482,
            880,
            571
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Для реализации выше указанного алгоритма современные виртуальные помощники должны обладать определенным набором необходимых навыков: распознавать и понимать естественный язык (NLP), обеспечивающие распознавание и генерацию речи (голоса и текста); поддерживать многоканальную интеграцию; сохранять и использовать контекст диалога с пользователем; диалоговые элементы управления, относящиеся к системе управления диалогами; иметь доступ к БД и брать оттуда необходимую информацию для пользователя; компоненты для решения задач и принятия решений. ",
        "bbox": [
            112,
            573,
            880,
            678
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Актуальность проведения научных исследований в данном направлении подтверждается растущим спросом на использование виртуальных помощников (Сбер “Салют”, “Amazon Alexa”, Microsoft “Cortana”), а также увеличением разнообразия программных средств для их разработки. Применение виртуальных помощников широко распространено в компаниях и предприятиях для автоматизации клиентского обслуживания, и не только, которые в свою очередь направленны на оптимизацию производственной деятельности пользователя. ",
        "bbox": [
            112,
            678,
            880,
            768
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Данная работа вносит вклад в направления автоматизации разработки ВА в данной статье используется MDA подход. Model Driven Architecture (MDA) — модельно-ориентированный ",
        "bbox": [
            114,
            768,
            880,
            799
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "$6 ^ { \\mathrm { t h } }$ International Workshop on Information, Computation, and Control Systems for Distributed Environments (ICCS-DE 2024), July 01–05, 2024, Irkutsk, Russia ",
        "bbox": [
            114,
            825,
            882,
            847
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "EMAIL: nikitadopiro@gmail.com ",
        "bbox": [
            116,
            847,
            306,
            859
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "ORCID:0009-0007-2621-9069 ",
        "bbox": [
            116,
            859,
            287,
            869
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "се ",
        "bbox": [
            116,
            869,
            183,
            885
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "$©$ 2024 Copyright for this paper by its authors. Use permitted under Creative Commons License Attribution 4.0 International (CC BY 4.0). ",
        "bbox": [
            196,
            872,
            767,
            883
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "ICCS-DE 2024 Workshop Proceedings ",
        "bbox": [
            198,
            885,
            412,
            896
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "DOI: 10.47350/ICCS-DE.2024.12 ",
        "bbox": [
            198,
            897,
            385,
            907
        ],
        "page_idx": 0
    },
    {
        "type": "page_number",
        "text": "",
        "bbox": [
            488,
            956,
            506,
            967
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "подход к разработке программного обеспечения. Принцип работы этого подхода состоит в создание абстрактной метамодели управления и обмена метаданными, то есть моделями. И в последующем задании способов ее преобразования в поддерживаемые технологии программирования, такие как $\\mathrm { C } { + + }$ , Java и другие. На примере [3], были сформулированы модели MDA и их трансформации (рис. 1). ",
        "bbox": [
            114,
            85,
            882,
            160
        ],
        "page_idx": 1
    },
    {
        "type": "image",
        "img_path": "images/ea8b2d076db34d7761c2142b606e483ee02eaaf5e9855920781b3215e8ab8bc0.jpg",
        "image_caption": [
            "Рисунок 1: Концепция средства: модели MDA и их трансформации "
        ],
        "image_footnote": [],
        "bbox": [
            200,
            162,
            838,
            496
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "2. Платформенно-зависимая модель JAICP ",
        "text_level": 1,
        "bbox": [
            114,
            536,
            569,
            555
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "В качестве платформы разработки ВА выбрана JAICP.Just AI Conversational Platform (JAICP Ultimate) — это комплексное программное решение для разработки, внедрения, эксплуатации и поддержки интеллектуальных чат-ботов и голосовых помощников. Платформа использует передовые алгоритмы анализа естественного языка и эффективно сочетает подходы на основе правил и машинного обучения. ",
        "bbox": [
            114,
            571,
            882,
            647
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Согласно используемой MDA методологии была разработана платформенно-зависимые модели JAICP на языке Java.Далее будут рассмотрены основные классы и их взаимосвязи. ",
        "bbox": [
            114,
            647,
            880,
            676
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Диаграмма классов (рис. 2) описывает работу платформы JAICP, а также наглядно показывает его составляющие компоненты. Таким образом созданный ВА на данной платформе поддерживает многоканальность (Phone channels, Customer engagement platforms, Inbound channels), обработку естественного языка, благодаря встроенному NLU API (Caila, Dialogflow), что обеспечивает обработку сущностей, на базе платформы имеется два вида сущностей- пользовательские сущности (User entity) и системные сущности (System entity), а также поддерживает работу с переходами между состояниями, по принципу конечного автомата. ",
        "bbox": [
            114,
            676,
            880,
            782
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Состояние (рис. 3) может хранить контекст, структуру, которая представляет текущий контекст обработки запроса. JAICP также позволяет сохранять произвольные данные о текущей сессии. После выполнения реакций бота содержимое сессии сохраняется во внутренней базе данных и хранится между запросами пользователя. При завершении сессии эти данные очищаются. Переход между состояниями осуществляется благодаря тегам активации (н-р теги q или q!, intent или intent!) и реакций (н-р теги go или go!).JAICP позволяет гибко настроить выполнения тегов активации, разметить область действия (н-р параметр onlyThisState),или указать определённый переход в определённое состояние (н-р параметр ToState). Также в JAICP ",
        "bbox": [
            114,
            782,
            882,
            904
        ],
        "page_idx": 1
    },
    {
        "type": "page_number",
        "text": "",
        "bbox": [
            488,
            956,
            508,
            967
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "имеется гибкая настройка обработки намерений, благодаря встроенному NLU API, при активации тегов intent или intent! ",
        "bbox": [
            114,
            85,
            880,
            116
        ],
        "page_idx": 2
    },
    {
        "type": "image",
        "img_path": "images/2be65de735630543da3ebc7c5b30ab5ce4966d8fffd070bc5871d1e7ff1d9995.jpg",
        "image_caption": [
            "Рисунок 2: Диаграмма классов основных элементов JAICP "
        ],
        "image_footnote": [],
        "bbox": [
            213,
            136,
            789,
            349
        ],
        "page_idx": 2
    },
    {
        "type": "image",
        "img_path": "images/9723047c3103d0b8297ce8c601f77dd185dc1ffd5e5b45f2e7101a5efdc9b4d2.jpg",
        "image_caption": [
            "Рисунок 3: Диаграмма классов, описывающая взаимосвязь переходов и состояний "
        ],
        "image_footnote": [],
        "bbox": [
            287,
            394,
            730,
            701
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Диаграмма классов (рис. 4) описывает то, как обрабатываются намерения и сущности с заполнением слотов (слот-филлинг), и их компоненты. Обработка происходит следующем образом: фраза, которая была распознанная из общего контекста, благодаря заполненным паттернам и/или тренировочным фразам, представляет собой активацию для перехода в другое состояние, также в этом же контексте, где была распознана фраза, обрабатываются сущности, при распознавании которых заполняются определённые слоты. Заполненные слоты имеют следующие параметры: название — имя слота; сущность — системная, либо пользовательская сущность, задающая тип данных, которые попадут в слот; required — параметр активен, если слот обязателен для заполнения, чтобы обработать интент; массив — если параметр активен, то в слот помещаются все сущности данного типа, оформленные как массив; questions — указываются вопросы, которые задаются в процессе уточнения незаполненных слотов. ",
        "bbox": [
            114,
            736,
            882,
            902
        ],
        "page_idx": 2
    },
    {
        "type": "page_number",
        "text": "93 ",
        "bbox": [
            488,
            956,
            508,
            967
        ],
        "page_idx": 2
    },
    {
        "type": "image",
        "img_path": "images/54579446fbd4ea95bbf31e9223e48334703e7f5032fd5063c0ba50380aa6c955.jpg",
        "image_caption": [
            "Рисунок 4.Классы для хранения информации о намерениях и сущностей с заполнением слотов, и их компонентов "
        ],
        "image_footnote": [],
        "bbox": [
            154,
            80,
            841,
            339
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "3. Иллюстративный пример ",
        "text_level": 1,
        "bbox": [
            114,
            394,
            415,
            413
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "В качестве примера был разработан чат-бот для поиска и ремонта неисправностей стиральной машины. Для формирования множества возможных неисправностей и соответствующего множества рекомендаций по их устранению было использовано руководство по ремонту неисправностей стиральных машин “Samsung” [4]. Разработанный чат-бот функционирует путем анализа описания обнаруженной неисправности в стиральной машине со стороны пользователя. В зависимости от характера и описания выявленной проблемы, бот переходит в различные состояния диалога. С учетом последующих ответов пользователя, чат-бот принимает решения относительно методов устранения указанной неисправности. ",
        "bbox": [
            114,
            429,
            882,
            549
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Чат-бот включает следующие состояния: старт, начальное состояние бота; меню; стиральная машинка не функционирует; в резервуар не поступает вода; не запрограммированная остановка во время стирки; не работает таймер; барабан не крутится; отключения бота; обработка исключений; и следующие сущности: стиральная машина; резервуар; барабан; таймер. ",
        "bbox": [
            114,
            549,
            880,
            609
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Сущности и намерения были описаны в терминах общей модели разговорного интерфейса [1]. Состояния и переходы между ними описаны в разрабатываемой в настоящие время проблемно-ориентированной модели диалога для диагностика неисправности бытовых приборов. ",
        "bbox": [
            114,
            610,
            880,
            669
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Задачей генератора является формирование спецификаций языкового интерфейса и кода управления диалогом на языке сценария JAICP DSL на основе разработанной и представленной выше платформенно-зависимой моделей JAICP: ",
        "bbox": [
            114,
            669,
            880,
            714
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Описание алгоритма работы генератора: ",
        "bbox": [
            139,
            714,
            466,
            729
        ],
        "page_idx": 3
    },
    {
        "type": "list",
        "sub_type": "text",
        "list_items": [
            "1. Заполняются объекты представленной информационной модели (интерфейса генератора) (фрагмент представлен на рис. 5). ",
            "2. Осуществляется генерация кода управления диалогом в форме языка сценария JAICP DSL на основе информации из объектов (фрагмент представлен на рис. 5). "
        ],
        "bbox": [
            139,
            730,
            878,
            790
        ],
        "page_idx": 3
    },
    {
        "type": "page_number",
        "text": "",
        "bbox": [
            488,
            956,
            508,
            967
        ],
        "page_idx": 3
    },
    {
        "type": "image",
        "img_path": "images/51027a01e3f67e43b8cfb7cea9c3a97a891e8ff5c73e63b04f82e04a60d3df51.jpg",
        "image_caption": [],
        "image_footnote": [],
        "bbox": [
            235,
            87,
            757,
            244
        ],
        "page_idx": 4
    },
    {
        "type": "image",
        "img_path": "images/ad466906506c1662d436260cd5a83fbc531a34a2fe6989b70e442723fb6f2ea3.jpg",
        "image_caption": [
            "Рисунок 5: Фрагмент входных и выходных данных работы генератора "
        ],
        "image_footnote": [],
        "bbox": [
            287,
            245,
            708,
            587
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "4. Заключение ",
        "text_level": 1,
        "bbox": [
            114,
            628,
            277,
            643
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "В представленной статье был проведен анализ и разработка генератора платформенно- зависимой модели для системы проектирования виртуальных помощников, основанных на технологии JUST AI с использованием платформы JAICP посредством Model-Driven Architecture (MDA) подхода. Основной целью исследования являлось создание эффективного инструмента для автоматизации процесса создания виртуальных помощников на данной платформе. ",
        "bbox": [
            114,
            663,
            882,
            738
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "Были рассмотрены модели MDA и их трансформации, что позволило выявить основные преимущества данного подхода при разработке программного обеспечения. ",
        "bbox": [
            114,
            739,
            880,
            768
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "Особое внимание было уделено объектным платформенно-зависимым моделям, используемым в рамках платформы JAICP. Подробно была описана структура этих моделей, их взаимосвязи и функциональные возможности, что способствовало более полному пониманию принципов работы данной системы. ",
        "bbox": [
            114,
            769,
            880,
            827
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "В заключение статьи был представлен иллюстративный пример работы генератора платформенно-зависимой модели, с практическим применением разработанных концепций. Данный пример продемонстрировал эффективность и функциональность генератора по созданию виртуальных помощников на основе JUST AI с использованием платформы JAICP. ",
        "bbox": [
            114,
            828,
            880,
            888
        ],
        "page_idx": 4
    },
    {
        "type": "page_number",
        "text": "95 ",
        "bbox": [
            488,
            956,
            508,
            967
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "5. Список литературы ",
        "text_level": 1,
        "bbox": [
            116,
            87,
            351,
            106
        ],
        "page_idx": 5
    },
    {
        "type": "list",
        "sub_type": "ref_text",
        "list_items": [
            "[1] А.Б. Столбов, Н.О. Дородных, О.А. Николайчук, А.Ю. Юрин, Н.В. Допиро. Генерация и трансформация специализированных моделей для проблемно-ориентированного интеллектуального помощника //Материалы конференции «Ляпуновские чтения 2023». – Иркутск: ИДСТУ СО РАН, 2023. – 184 с. ",
            "[2] A. Yurin, O. Nikolaychuk, N. Dorodnykh, A. Stolbov Towards knowledge-based virtual assistant development with the aid of ontology // International Multi-Conference on Engineering, Computer and Information Sciences (SIBIRCON). – 2022. – 830-834 pp. ",
            "[3] Pérez-Soler S., Guerra E., de Lara J. Model-Driven Chatbot Development.Lecture Notes in Computer Science. – 2020. Vol. 12400, pp. 207–222. ",
            "[4] Руководство по работе со стиральными машинами Samsung, 2024. URL: https://www.samsung.com/ru/support/category/home-appliances/laundry/ "
        ],
        "bbox": [
            117,
            121,
            882,
            287
        ],
        "page_idx": 5
    },
    {
        "type": "page_number",
        "text": "",
        "bbox": [
            488,
            956,
            508,
            967
        ],
        "page_idx": 5
    }
]