[
    {
        "type": "text",
        "text": "Средство мониторинга узлов системы управления сервис- ориентированными научными приложениями ",
        "text_level": 1,
        "bbox": [
            116,
            87,
            882,
            136
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Дмитрий Яковлев 1, Михаил Воскобойников 1, Роман Костромин 1 ",
        "bbox": [
            114,
            149,
            695,
            168
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "1 Институт динамики систем и теории управления им. В.М. Матросова СО РАН, ул. Лермонтова, д. 134, 664033, Иркутск, Россия ",
        "bbox": [
            114,
            180,
            882,
            209
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Аннотация ",
        "text_level": 1,
        "bbox": [
            210,
            239,
            304,
            252
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "В работе рассматривается архитектура программного средства, предназначенного для мониторинга (сбора, хранения и агрегирования ключевых метрик) производительности вычислительных узлов в гетерогенной распределенной вычислительной среде с целью предоставления актуальных метрик системе управления сервис-ориентированными научными приложениями. Полученные сведения позволяют снизить неопределенность при планировании вычислений, улучшить загрузку вычислительных узлов, а также сократить время проведения вычислительного эксперимента. ",
        "bbox": [
            208,
            255,
            882,
            356
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Ключевые слова ",
        "text_level": 1,
        "bbox": [
            210,
            370,
            351,
            383
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Гетерогенная распределенная вычислительная среда, вычислительные процессы, мониторинг, управление вычислениями ",
        "bbox": [
            210,
            385,
            880,
            414
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "1. Введение ",
        "text_level": 1,
        "bbox": [
            116,
            432,
            252,
            450
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Система мониторинга является неотъемлемой частью управления распределенными вычислениями [1]. Ее основная задача — предоставление актуальных и достоверных сведений о состоянии всех компонентов гетерогенной распределенной вычислительной среды. Она включает в себя сбор и анализ данных о загрузке процессоров, использовании памяти, состоянии сети, доступности и состоянии хранилищ данных, а также о текущем состоянии выполняемых задач. Существующие системы мониторинга, такие как NetData, Nagios, Zabbix и др. [2], ориентированы в основном на администраторов ресурсов, а предоставляемые ими сведения порой являются избыточными, т.к. как необходимо собирать ограниченный набор метрик при планировании вычислительных экспериментов в задаче управления сервис-ориентированными научными приложениями. Зачастую такие приложения и сам вычислительный процесс представлены в виде workflow (научный рабочий процесс). Во время вычислений используются разнородные вычислительные ресурсы, в том числе облачные. Поэтому актуализируется разработка специализированных программных средств, которые позволят собирать необходимые метрики из разных источников (типов ресурсов) и предоставлять их системе управления вычислениями в нужном виде [3]. ",
        "bbox": [
            114,
            467,
            882,
            694
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "2. Архитектура программного средства ",
        "text_level": 1,
        "bbox": [
            114,
            711,
            531,
            730
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Архитектура программного средства представлена на рис. 1. На схеме изображены три узла («Node 1», «Node 2» и «Node 3» соответственно), с развернутыми на них модулями программного средства. Узел под названием «Node 2» представляет собой основной узел. ",
        "bbox": [
            114,
            745,
            883,
            792
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "$6 ^ { \\mathrm { t h } }$ International Workshop on Information, Computation, and Control Systems for Distributed Environments (ICCS-DE 2024), July 01–05, 2024, Irkutsk, Russia ",
        "bbox": [
            114,
            831,
            882,
            853
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "EMAIL: dimasgamer353@gmail.com (A. 1); mikev1988@mail.ru (A. 2); roman@kostromin.net (A. 3) ",
        "bbox": [
            114,
            855,
            681,
            866
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "ORCID: 0009-0009-7973-1685 (A. 1); 0000-0003-3034-4907 (A. 2); 0000-0001-8406-8106 (A. 3) ",
        "bbox": [
            114,
            866,
            654,
            876
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "B ",
        "bbox": [
            114,
            876,
            183,
            893
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "$©$ 2024 Copyright for this paper by its authors. Use permitted under Creative Commons License Attribution 4.0 International (CC BY 4.0). ",
        "bbox": [
            196,
            878,
            767,
            890
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "ICCS-DE 2024 Workshop Proceedings ",
        "bbox": [
            196,
            891,
            414,
            903
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "DOI: 10.47350/ICCS-DE.2024.34 ",
        "bbox": [
            196,
            903,
            387,
            913
        ],
        "page_idx": 0
    },
    {
        "type": "page_number",
        "text": "220 ",
        "bbox": [
            483,
            954,
            515,
            967
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Сервис под названием «Exporter0», обращается ко всем узлам из списка, для получения информации о их доступности. Prometheus обращается к экспортерам на всех узлах через их API для сбора метрик и сохранения их в базу данных. Все это происходит с помощью pull запросов Prometheus к экспортерам. Сервис под названием «Backend» обращается к Prometheus через API, чтобы получать данные из базы данных и предоставлять эти же данные после обработки через собственное API. ",
        "bbox": [
            114,
            85,
            882,
            175
        ],
        "page_idx": 1
    },
    {
        "type": "image",
        "img_path": "images/b0672deb5273c73a5430a4a5a2d93b339b6d0e06d0809d573658c90c888fad01.jpg",
        "image_caption": [
            "Рисунок 1: Архитектура программного комплекса мониторинга "
        ],
        "image_footnote": [],
        "bbox": [
            139,
            194,
            870,
            542
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Программное средство состоит из трех модулей (модуль управления, модуль сбора характеристик узла, модуль мониторинга процессов). В состав каждого модуля входят сервисы, которые были реализованы на языке программирования Python с использованием библиотек FastAPI и prometheus_client, которая является клиентской библиотекой для создания экспортера на языке программирования Python. Рассмотрим каждый модуль подробнее. ",
        "bbox": [
            114,
            583,
            880,
            657
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Модуль управления. Состоит из трех сервисов: Prometheus, Backend и Exporter0. Является основным модулем программного комплекса. Данный модуль должен быть развернут на основном узле и работать на постоянной основе, поскольку он содержит базу данных и сервисы, которые должны работать постоянно. ",
        "bbox": [
            114,
            657,
            880,
            718
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Модуль сбора характеристик узла. Состоит из одного сервиса: Exporter1. Данный модуль должен быть на каждом узле, с которого необходимо собирать характеристики о компонентах устройства. ",
        "bbox": [
            114,
            718,
            878,
            762
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Модуль мониторинга процессов. Состоит из одного сервиса: Exporter2. Данный модуль должен быть развернут на каждом узле, на котором необходимо выполнять мониторинг процессов. Модули сбора характеристик узла и мониторинга процессов не должны работать на постоянной основе и запускаются по требованию. ",
        "bbox": [
            114,
            763,
            880,
            824
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "3. Заключение ",
        "text_level": 1,
        "bbox": [
            114,
            842,
            277,
            858
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Программное средство было развернуто и протестировано в испытательном стенде для мониторинга работы системы, реализующей методы структурно-параметрической оптимизации ",
        "bbox": [
            114,
            877,
            883,
            909
        ],
        "page_idx": 1
    },
    {
        "type": "page_number",
        "text": "221 ",
        "bbox": [
            483,
            954,
            511,
            967
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "модели энергетического комплекса. Целью выполнения мониторинга являлось определение вычислительных характеристик работы системы для определения наилучшего метода структурно-параметрической оптимизации. В качестве измеряемых параметров работы системы были выбраны расход оперативной памяти и использование процессора. Полученные сведения позволили учитывать при планировании критерии выполнения задачи и доступные квоты при распределении вычислительных модулей между доступными вычислительными ресурсами гетерогенной среды. ",
        "bbox": [
            112,
            85,
            882,
            192
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "4. Благодарности ",
        "text_level": 1,
        "bbox": [
            114,
            209,
            306,
            226
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Исследование выполнено при поддержке Министерства науки и высшего образования Российской Федерации, проект № FWEW-2021-0005 «Технологии разработки и анализа предметно-ориентированных интеллектуальных систем группового управления в недетерминированных распределенных средах» (рег. № 121032400051-9). ",
        "bbox": [
            114,
            244,
            882,
            305
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "5. Список литературы ",
        "text_level": 1,
        "bbox": [
            114,
            323,
            351,
            342
        ],
        "page_idx": 2
    },
    {
        "type": "list",
        "sub_type": "ref_text",
        "list_items": [
            "1. Костромин Р.О. Особенности реализации системы мониторинга гетерогенной вычислительной среды // Современные наукоемкие технологии. 2023. № 12. Ч. 3. С. 86–94. ",
            "2. Stefanov K.S., Pawar S., Ranjan A., Wandhekar S., Voevodin V.V. A Review of Supercomputer Performance Monitoring Systems // Supercomputing Frontiers and Innovations. 2021. Vol. 8. Is. 3. P. 62-81. DOI: 10.14529/jsfi210304. ",
            "3. Черных А.Н., Бычков И.В., Феоктистов А.Г., Горский С.А., Сидоров И.А., Костромин Р.О., Еделев А.В., Зоркальцев В.И., Аветисян А.И. Смягчение неопределенности при разработке научных приложений в интегрированной среде // Труды Института системного программирования РАН. 2021. Т. 33. № 1. С. 151-172. DOI: 10.15514/ISPRAS-2021-33(1)-11. "
        ],
        "bbox": [
            114,
            357,
            882,
            494
        ],
        "page_idx": 2
    },
    {
        "type": "page_number",
        "text": "222 ",
        "bbox": [
            483,
            954,
            513,
            967
        ],
        "page_idx": 2
    }
]