[
    {
        "type": "text",
        "text": "Методы и средства разработки и применения испытательного стенда сервис-ориентированных приложений ",
        "text_level": 1,
        "bbox": [
            114,
            87,
            882,
            159
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Александр Феоктистов 1, Михаил Воскобойников 1, Алексей Еделев 1,2 ",
        "bbox": [
            114,
            172,
            725,
            191
        ],
        "page_idx": 0
    },
    {
        "type": "list",
        "sub_type": "text",
        "list_items": [
            "1 Институт динамики систем и теории управления им. В.М. Матросова СО РАН, ул. Лермонтова, д. 134, 664033, Иркутск, Россия ",
            "2 Институт систем энергетики им. Л.А. Мелентьева СО РАН, ул. Лермонтова, д. 130, 664033, Иркутск, Россия "
        ],
        "bbox": [
            114,
            203,
            882,
            257
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Аннотация ",
        "text_level": 1,
        "bbox": [
            210,
            274,
            304,
            287
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Рассматривается подход к разработке и применению испытательного стенда сервис- ориентированных приложений в гетерогенной распределенной вычислительной среде. Целью испытательного стенда является обеспечение разработчиков средствами проведения экспериментов по оценке качества данных, работы алгоритмов, анализа результатов вычислений и других аспектов реализации сервис-ориентированных приложений. Сервис-ориентированное приложение создается на основе рабочих процессов, представляемых в виде композиции веб-сервисов. Веб-сервисы реализуют выполнение прикладного и системного программного обеспечения. Прикладное программное обеспечение поддерживает выполнение операций предметной области приложения. Суть и новизна подхода заключается в использовании в рамках испытательного стенда системного программного обеспечения, предоставляющего дополнительные функции обработки и анализа данных, получения информации с контрольно-измерительного оборудования и многокритериального выбора оптимальных результатов вычислений. Рабочие процессы могут быть представлены в стандартной форме на декларативном языке Business Process Execution Language для использования во внешних системах управления рабочими процессами. ",
        "bbox": [
            208,
            289,
            882,
            521
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Ключевые слова ",
        "text_level": 1,
        "bbox": [
            210,
            534,
            351,
            547
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Научные приложения, рабочие процессы, сервисы, испытательные стенды ",
        "bbox": [
            210,
            549,
            779,
            565
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "1. Введение ",
        "text_level": 1,
        "bbox": [
            114,
            581,
            252,
            600
        ],
        "page_idx": 0
    },
    {
        "type": "list",
        "sub_type": "text",
        "list_items": [
            "В настоящее время чрезвычайную актуальность приобретает исследование современного состояния природно-технических систем (ПТС) [1]. Природно-техническая система представляет собой совокупность форм и состояний различных процессов взаимодействия компонентов природной среды с инженерными сооружениями на всех стадиях ее функционирования [2]. К таким системам относятся, например, энергетические комплексы на разных уровнях их территориально-отраслевой иерархии, включая микросети различных инфраструктурных объектов. Как правило, в рамках подобных исследований рассматривается оптимизации взаимодействия между естественными и искусственными компонентами ПТС [3]. ",
            "В рамках цифрового мониторинга Байкальской природной территории (БПТ) [4] разрабатываются новые модели, алгоритмическое и программное обеспечение (ПО), научные сервисы, инструментальные средства и методики исследования функционирования и развития ПТС, располагающихся на БПТ. В частности, данная работа посвящена методам и средствам разработки и применения испытательного стенда сервис-ориентированных приложений для "
        ],
        "bbox": [
            112,
            617,
            882,
            814
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "$6 ^ { \\mathrm { t h } }$ International Workshop on Information, Computation, and Control Systems for Distributed Environments (ICCS-DE 2024), July 01–05, 2024, Irkutsk, Russia ",
        "bbox": [
            114,
            831,
            880,
            853
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "EMAIL: agf@icc.ru (A. 1); mikev1988@mail.ru (A. 2); flower@isem.irk.ru (A. 3) ",
        "bbox": [
            116,
            855,
            569,
            865
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "ORCID: 0000-0002-9127-6162 (A. 1); 0000-0003-3034-4907 (A. 2); 0000-0003-2219-9754 (A. 3) ",
        "bbox": [
            116,
            866,
            654,
            876
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "со 0 ",
        "bbox": [
            116,
            876,
            183,
            891
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "$©$ 2024 Copyright for this paper by its authors. Use permitted under Creative Commons License Attribution 4.0 International (CC BY 4.0). ",
        "bbox": [
            196,
            878,
            767,
            889
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "ICCS-DE 2024 Workshop Proceedings ",
        "bbox": [
            198,
            891,
            412,
            903
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "DOI: 10.47350/ICCS-DE.2024.23 ",
        "bbox": [
            196,
            903,
            385,
            914
        ],
        "page_idx": 0
    },
    {
        "type": "page_number",
        "text": "169 ",
        "bbox": [
            484,
            954,
            515,
            967
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "моделирования, структурно-параметрической оптимизации, экологической и технико- экономической оценки ПТС. Основной акцент делается на сервис-ориентированные приложения, создаваемые на основе рабочих процессов в виде композиции веб-сервисов. ",
        "bbox": [
            112,
            85,
            880,
            130
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Существует широкий спектр систем управления рабочими процессами (см., например, краткий обзор в [5]), в том числе систем, поддерживающих сервис-ориентированные рабочие процессы [6-8]. Однако средства тестирования и испытания компонентов сервис- ориентированных приложений в этих системах слабо развиты. В этой связи в рамках данного исследования предложены новые методы и средства разработки и применения испытательного стенда сервис-ориентированных приложений в гетерогенной распределенной вычислительной среде. Применение предложенных разработок проиллюстрировано на примере исследования работы модуля моделирования функционирования энергетических комплексов, относящихся к разным уровням их территориально-отраслевой иерархии. ",
        "bbox": [
            112,
            131,
            883,
            267
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "2. Испытательный стенд ",
        "text_level": 1,
        "bbox": [
            114,
            283,
            380,
            302
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Термин испытательный стенд (англ., testbed) [9] широко используется в научных исследованиях, в частности, в рамках создания, развития и использования информационно- вычислительных и телекоммуникационных систем и технологий, для определения программно- аппаратной среды, специализированной для проведения экспериментов, связанных с тестированием и испытанием новых алгоритмических и программных разработок, различных технологических решений и источников данных, а также систем их извлечения, обработки, передачи, хранения и анализа, перед внедрением создаваемых или модифицируемых систем и технологий. Испытательные стенды создаются в физической или виртуальной формах с целью обеспечения разработчиков контролируемой средой для проверки работоспособности, удовлетворения функциональным и системным требованиям, производительности, эффективности использования ресурсов и других свойств исследуемых систем и технологий. ",
        "bbox": [
            112,
            319,
            882,
            484
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "В рамках данного исследования испытательный стенд сервис-ориентированных приложений реализован с помощью инструментального комплекса Framework for Development and Execution of Scientific WorkFlows (FDE-SWFs) [10] в виде НРП, включающего сервисы для выполнения прикладного и системного программного обеспечения. FDE-SWFs поддерживает и существенно развивает набор функциональных возможностей программного комплекса Orlando Tools [11]. ",
        "bbox": [
            112,
            484,
            880,
            559
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Архитектура FDE-SWFs включает следующие основные компоненты: пользовательский интерфейс, конструктор вычислительной модели разрабатываемого приложения, конструктор модулей и сервисов их выполнения, менеджер ПО, менеджер вычислений, менеджер вычислительных процессов и состояния среды, API для доступа к информационно- вычислительным ресурсам и системам. ",
        "bbox": [
            112,
            559,
            880,
            634
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Общая структура испытательного стенда, разрабатываемого с помощью FDE-SWFs, представлена на рисунке 1. Стенд создается в виде рабочего процесса, дополненного набором системных операций. Рабочий процесс выполняется менеджером вычислений FDE-SWFs. ",
        "bbox": [
            112,
            634,
            880,
            680
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Рабочий процесс представляется на стандартизированном декларативном языке Business Process Execution Language (BPEL) [12] и в дальнейшем может использоваться любыми внешними системами управления рабочими процессами, поддерживающими BPEL. BPEL определяет модель для описания поведения сервис-ориентированных приложений в терминах взаимодействий (совокупности сообщений) между внутренними вычислительными процессами и их партнерами (внешними сервисами). В рамках сервис-ориентированной архитектуры применяются сервисы, представляющие модули разрабатываемого приложения и внешние приложения. Внешние приложения реализуют дополнительные системные операции обработки и анализа данных, получения информации с контрольно-измерительного оборудования и многокритериального выбора оптимальных результатов вычислений. В целом веб-сервис представляет программную систему со стандартизированными интерфейсами, идентифицируемую уникальным URL-адресом. При этом веб-сервисы не обладают знаниями о выполняемых приложениях, а приложения не нуждаются в информации о способах их выполнения веб-сервисами. ",
        "bbox": [
            112,
            680,
            882,
            891
        ],
        "page_idx": 1
    },
    {
        "type": "page_number",
        "text": "170 ",
        "bbox": [
            484,
            954,
            515,
            967
        ],
        "page_idx": 1
    },
    {
        "type": "image",
        "img_path": "images/19b7471ad461dc5efd9b4002c418be3087caa9073f475b3224128fd4353f6515.jpg",
        "image_caption": [
            "Рисунок 1: Структура испытательного стенда "
        ],
        "image_footnote": [],
        "bbox": [
            178,
            81,
            823,
            539
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "3. Пример ",
        "text_level": 1,
        "bbox": [
            116,
            574,
            234,
            593
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "В качестве примера применения испытательного стенда исследован набор методов структурно-параметрической оптимизации модели энергетического комплекса с помощью библиотеки pagmo [13]. Библиотека pagmo, реализованная на языке $\\mathrm { C } { + + }$ , предназначена для параллельной оптимизации. Она предоставляет унифицированный интерфейс для алгоритмов оптимизации с целью упрощения их развертывания в вычислительных средах с массовым параллелизмом. ",
        "bbox": [
            114,
            609,
            882,
            698
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Исследовано 60 методов библиотеки pagmo с их настройками, заданными по умолчанию. Результаты сравнительного анализа методов структурно-параметрической оптимизации энергетического комплекса национального уровня территориально-отраслевой иерархии представлены на рисунке 2. ",
        "bbox": [
            114,
            699,
            880,
            760
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "За допустимое время решения задачи полностью отработали пять методов: $( \\mathrm { N } { + } 1 )$ )-ES Simple Evolutionary Algorithm (м1), Augmented Lagrangian algorithm (м2), Method of Moving Asymptotes (м3), Algorithm AGS to solve constrained nonlinear programming problems with Lipschitzian functions (м4) и Interior Point OPTimizer (м5). Среднее время выполнения метода, средний размер используемой им оперативной памяти и средняя загрузка процессора были получены путем профилирования процесса выполнения модуля для конкретного метода. ",
        "bbox": [
            114,
            760,
            880,
            849
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "На основе многокритериального выбора единственного варианта значений критериев по всем трем правилам (Парето-оптимальному, мажоритарному и лексикографическому) наиболее приемлемым методом является метод м5. ",
        "bbox": [
            114,
            850,
            880,
            895
        ],
        "page_idx": 2
    },
    {
        "type": "page_number",
        "text": "171 ",
        "bbox": [
            484,
            954,
            511,
            967
        ],
        "page_idx": 2
    },
    {
        "type": "image",
        "img_path": "images/4e878cf9fdd6cd7e68379a3491109bc0db5e949cf31a6626b474e9e8b7debd6e.jpg",
        "image_caption": [
            "а) "
        ],
        "image_footnote": [],
        "bbox": [
            134,
            85,
            489,
            225
        ],
        "page_idx": 3
    },
    {
        "type": "image",
        "img_path": "images/b2b47c3788b2fd4fc0d5d57e656a65d48b634c9cdc9049d4f83bcb40c6d189cb.jpg",
        "image_caption": [
            "б) "
        ],
        "image_footnote": [],
        "bbox": [
            510,
            86,
            865,
            225
        ],
        "page_idx": 3
    },
    {
        "type": "image",
        "img_path": "images/9c74ce0600f35e6f302f005316b645dff05cbcaf053ac9463b7fc16644324998.jpg",
        "image_caption": [
            "в) "
        ],
        "image_footnote": [],
        "bbox": [
            138,
            263,
            489,
            403
        ],
        "page_idx": 3
    },
    {
        "type": "image",
        "img_path": "images/689bd0abcf78f25b3e8bafadb5639ed96abc3f7310f66f89bd1c003846564873.jpg",
        "image_caption": [
            "г) "
        ],
        "image_footnote": [],
        "bbox": [
            511,
            264,
            867,
            402
        ],
        "page_idx": 3
    },
    {
        "type": "image",
        "img_path": "images/2d5de148006b1e957e45089bfb1cae87b408d5fe6a3e7d86369312c66df01663.jpg",
        "image_caption": [
            "д) "
        ],
        "image_footnote": [],
        "bbox": [
            129,
            441,
            484,
            579
        ],
        "page_idx": 3
    },
    {
        "type": "image",
        "img_path": "images/3ac96d321ef401b45b050c7e43cb3b9b20c86409bed6099a8a363d0575ad3ea4.jpg",
        "image_caption": [
            "е) ",
            "Рисунок 2: Результаты сравнительного анализа по следующим критериям: среднее время выполнения метода (а), средний размер используемой оперативной памяти (б), средняя загрузка процессора (в), число мероприятий структурно-параметрической оптимизации (г), средняя стоимость мероприятий (д), показатель живучести (е) "
        ],
        "image_footnote": [],
        "bbox": [
            508,
            442,
            863,
            580
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "4. Заключение ",
        "text_level": 1,
        "bbox": [
            114,
            714,
            277,
            732
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "В рамках исследования предложены новые методы и средства разработки и применения испытательного стенда сервис-ориентированных приложений. Разработан испытательный стенд для исследования работы модуля моделирования энергетических комплексов, относящихся к разным уровням их территориально-отраслевой иерархии. Модуль реализует набор методов структурно-параметрической оптимизации модели энергетического комплекса с помощью библиотеки pagmo. ",
        "bbox": [
            114,
            750,
            882,
            840
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Стенд ориентирован на тестирование сервиса для выполнения данного модуля на вычислительных ресурсах с разными вычислительными характеристиками. Применение стенда позволило осуществить выбор алгоритмов, оптимальных по заданному набору критериев. ",
        "bbox": [
            114,
            840,
            880,
            887
        ],
        "page_idx": 3
    },
    {
        "type": "page_number",
        "text": "172 ",
        "bbox": [
            484,
            954,
            513,
            967
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "5. Благодарности ",
        "text_level": 1,
        "bbox": [
            116,
            87,
            306,
            104
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "Работа выполнена в рамках гранта № 075-15-2024-533 Министерства науки и высшего образования РФ на выполнение крупного научного проекта по приоритетным направлениям научно-технологического развития (проект «Фундаментальные исследования Байкальской природной территории на основе системы взаимосвязанных базовых методов, моделей, нейронных сетей и цифровой платформы экологического мониторинга окружающей среды», рег. № 124052100088-3). ",
        "bbox": [
            114,
            122,
            882,
            213
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "6. Список литературы ",
        "text_level": 1,
        "bbox": [
            114,
            231,
            350,
            249
        ],
        "page_idx": 4
    },
    {
        "type": "list",
        "sub_type": "ref_text",
        "list_items": [
            "[1] С. В. Исаев, Концепция природно-технических систем и ее использование при изучении антропогенной трансформации природной среды, Географический вестник, 2016, № 3 (38), c. 105–113. doi:10.17072/2079-7877-2016-3-105-113. ",
            "[2] А. Л. Ревзон, Картография состояния природно-технических систем, М., Недра, 1992. ",
            "[3] Т. К. Салина, Концептуальный подход к управлению устойчивым развитием ТЭК Северо- Западного федерального округа, Журнал экономической теории, 2016, № 4, с. 80–91. ",
            "[4] Цифровой мониторинг Байкальской природной территории. URL: https://baikalproject.icc.ru/. ",
            "[5] A. Feoktistov, A. Edelev, A. Tchernykh, S. Gorsky, O. Basharina, and E. Fereferov, An Approach to Implementing High-Performance Computing for Problem Solving in Workflow-based Energy Infrastructure Resilience Studies, Computation, 2023, vol. 11, no. 12, pp. 243. doi: 10.3390/computation11120243. ",
            "[6] J. Goecks, A. Nekrutenko, J. Taylor, and Galaxy Team, Galaxy: a comprehensive approach for supporting accessible, reproducible, and transparent computational research in the life sciences, Genome boil, 2010, vol. 11, pp. 1–13. doi:10.1186/gb-2010-11-8-r86. ",
            "[7] B. Balis, HyperFlow: A model of computation, programming approach and enactment engine for complex distributed workflows, Future Generation Computer Systems, 2016, vol. 55, pp. 147– 162. doi:10.1016/j.future.2015.08.015. ",
            "[8] M. H. Hilman, M. A. Rodriguez, and R. Buyya, Workflow-as-a-service cloud platform and deployment of bioinformatics workflow applications, in: Knowledge Management in the Development of Data-Intensive Systems, I. Mistrik, M. Galster, B. Maxim, B. Tekinerdogan (Eds.), CRC Press, Boca Raton, Florida, US, 2021, pp. 205–226. ",
            "[9] Г. И. Радченко, Распределенные виртуальные испытательные стенды: использование систем инженерного проектирования и анализа в распределенных вычислительных средах, Вестник Южно-Уральского государственного университета. Серия: Математическое моделирование и программирование, 2011, № 37 (254), с. 108–121. ",
            "[10] G. Danilov and M. Voskoboinikov, Testbed-based approach to testing a library for evaluating network reliability algorithms, Proceedings of the International Workshop on Critical Infrastructures in the Digital Worl (IWCI-2024), March 14-20, 2024, Bolshoe Goloustno, Russia, Irkutsk, ESI SB RAS, 2024, pp. 3-4. ",
            "[11] A. Feoktistov, S. Gorsky, I. Sidorov, I. Bychkov, A. Tchernykh, and A. Edelev Collaborative Development and Use of Scientific Applications in Orlando Tools: Integration, Delivery, and Deployment, Communications in Computer and Information Science, 2020, vol. 1087, pp. 18–32. doi:10.1007/978-3-030-41005-6_2. ",
            "[12] M. B. Juric, B. Mathew, and P.G. Sarang, Business process execution language for web services: an architect and developer's guide to orchestrating web services using BPEL4WS,Packt Publishing Ltd, 2006. ",
            "[13] F. Biscani and D. Izzo, A parallel global multiobjective framework for optimization: pagmo, Journal of Open Source Software, 2020, vol. 5, no. 53, pp. 2338. doi:10.21105/joss.02338. "
        ],
        "bbox": [
            117,
            264,
            880,
            852
        ],
        "page_idx": 4
    },
    {
        "type": "page_number",
        "text": "173 ",
        "bbox": [
            484,
            954,
            513,
            967
        ],
        "page_idx": 4
    }
]