[
    {
        "type": "text",
        "text": "Методы и средства реализации моделей алгоритмов анализа актинометрических показателей ",
        "text_level": 1,
        "bbox": [
            114,
            87,
            882,
            131
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Дмитрий Карамов1, Евгений Юмашев1 ",
        "bbox": [
            114,
            148,
            454,
            165
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "1 Институт динамики систем и теории управления им. В.М. Матросова СО РАН, ул. Лермонтова, д. 134, 664033, Иркутск, Россия ",
        "bbox": [
            114,
            178,
            878,
            206
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Аннотация ",
        "text_level": 1,
        "bbox": [
            210,
            223,
            304,
            235
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "В статье представлена реализация WPS-сервиса для моделирования актинометрических показателей для любых локаций. Сервис основывается на модифицированной математической модели Iqbal-Kasten/Czeplak, которая позволяет получать детализированные массивы данных по солнечной радиации. ",
        "bbox": [
            208,
            237,
            880,
            294
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "При реализации WPS-сервиса использовались специализированные библиотеки numpy, scipy, pywps, os, pywps-flask, которые позволяют оптимизировать алгоритмы рассматриваемой модели. ",
        "bbox": [
            208,
            295,
            880,
            337
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Результаты, полученные в ходе данного исследования, позволили значительно уменьшить время расчета, формирования массивов данных и их визуализации. Кроме того, характер полученных функций солнечной радиации говорит об адекватности рассматриваемой модели и WPS-сервиса реализующего её. ",
        "bbox": [
            208,
            338,
            880,
            396
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Ключевые слова ",
        "text_level": 1,
        "bbox": [
            210,
            410,
            351,
            423
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Солнечная радиация, актинометрические показатели, WPS-сервис, Python, FM 12 Synop, METAR ",
        "bbox": [
            208,
            425,
            880,
            454
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "1. Введение ",
        "text_level": 1,
        "bbox": [
            116,
            473,
            252,
            490
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Актинометрические показатели такие как прямая, рассеянная и суммарная солнечная радиации являются важными показателями для различных областей деятельности человека. Они могут использоваться в строительстве, энергетике, сельском хозяйстве и многих других сферах. Наличие достоверных актинометрических данных является важным фактором, влияющим на конечные результаты прикладных и научно-исследовательских работ [1]. В частности, при решении различных задач в области энергетики мощность солнечной электростанции имеет прямую зависимость от уровня инсоляции. Следовательно, в случае решения задачи выбора оптимальной мощности фотоэлектрической системы необходимо располагать подробным и точным массивом данных [2]. ",
        "bbox": [
            114,
            509,
            880,
            643
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Цель данной статьи состоит в демонстрации подхода для моделирования солнечной радиации и реализующей её открытого WPS-сервиса. ",
        "bbox": [
            114,
            643,
            880,
            673
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "2. Постановка задачи разработки онлайн WPS-сервиса для расчета солнечной радиации ",
        "text_level": 1,
        "bbox": [
            114,
            692,
            880,
            730
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Постановка задачи разработки онлайн сервиса для расчета суммарной солнечной радиации основывается на следующих положениях: ",
        "bbox": [
            114,
            747,
            880,
            776
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "1. Открытый WPS-сервиса; ",
        "bbox": [
            141,
            777,
            372,
            792
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "$6 ^ { \\mathrm { { t h } } }$ International Workshop on Information, Computation, and Control Systems for Distributed Environments (ICCS-DE 2024), July 01–05, 2024, Irkutsk, Russia ",
        "bbox": [
            114,
            831,
            880,
            853
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "EMAIL dmitriy.karamov@mail.ru (A. 1); yumashevgeny@mail.ru (A. 2) ",
        "bbox": [
            114,
            853,
            518,
            866
        ],
        "page_idx": 0
    },
    {
        "type": "page_footnote",
        "text": "ORCID: 0000-0001-5360-4826 (A. 1); 0009-0003-8736-0155 (A. 2) ",
        "bbox": [
            114,
            866,
            491,
            876
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "(сс 0 ",
        "bbox": [
            107,
            876,
            173,
            891
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "$©$ 2024 Copyright for this paper by its authors. Use permitted under Creative Commons License Attribution 4.0 International (CC BY 4.0). ",
        "bbox": [
            188,
            878,
            757,
            888
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "ICCS-DE 2024 Workshop Proceedings ",
        "bbox": [
            188,
            891,
            404,
            903
        ],
        "page_idx": 0
    },
    {
        "type": "footer",
        "text": "DOI: 10.47350/ICCS-DE.2024.28 ",
        "bbox": [
            188,
            903,
            377,
            914
        ],
        "page_idx": 0
    },
    {
        "type": "page_number",
        "text": "195 ",
        "bbox": [
            484,
            954,
            513,
            967
        ],
        "page_idx": 0
    },
    {
        "type": "list",
        "sub_type": "text",
        "list_items": [
            "2. Возможность задавать любую локацию в зависимости от географических координат местности; ",
            "3. Автоматически формировать исходную климатическую информацию необходимую для моделирования актинометрических показателей; ",
            "4. Использовать данные необходимые для описания динамики масс в средних и нижних слоях атмосферы; ",
            "5. Формировать данные актинометрических показателей для типичного, оптимистичного и пессимистичного метеорологического года. "
        ],
        "bbox": [
            139,
            85,
            880,
            204
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Реализация основных положений данной постановки позволит получить сервис для формирования актинометрических данных для любой локации на основании ретроспективных природно-климатических данных формата FM 12 Synop и METAR. Также используются данные с открытых источников об спектральном составе области видимого света, наличия капель воды и водяного пара в атмосфере, а также озонового слоя. ",
        "bbox": [
            114,
            206,
            880,
            279
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Учитывая имеющуюся постановку, а также ряд факторов, описывающих требования к математической модели реализуемой в рамках сервиса было решено использовать модифицированную модель Iqbal-Kasten/Czeplak [3]. ",
        "bbox": [
            114,
            280,
            880,
            326
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "3. Краткое описание математической модели ",
        "text_level": 1,
        "bbox": [
            114,
            344,
            599,
            361
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "За основу была взята модифицированная математическая модель Iqbal-Kasten/Czeplak которая хорошо себя зарекомендовала при решении различных задач в области использования фотоэлектрических систем. В частности, при решении задач развития и функционирования солнечных электростанций. ",
        "bbox": [
            114,
            378,
            880,
            438
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Укрупненно модель включает в себя три основных блока: ",
        "bbox": [
            139,
            439,
            604,
            454
        ],
        "page_idx": 1
    },
    {
        "type": "list",
        "sub_type": "text",
        "list_items": [
            "1. Блок подготовки исходных климатических массивов необходимых для моделирования актинометрических показателей. ",
            "2. Блок моделирования солнечной радиации для рассматриваемой локации относительно каждого часа расчетного периода по ретроспективным многолетним массивам природно-климатической информации. При этом учитываются действительный часовой пояс территории формата UTC. ",
            "3. Блок формирования результатов моделирования прямой, рассеянной и суммарной солнечной радиации с определением типичного, пессимистичного и оптимистичного метеорологического года. "
        ],
        "bbox": [
            139,
            454,
            880,
            587
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Исходной информацией для математической модели солнечной радиации Iqbal-Kasten/Czeplak являются массивы данных формата FM 12 Synop и METAR [4]. ",
        "bbox": [
            114,
            589,
            880,
            619
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "FM 12 SYNOP – это код для оперативной передачи данных приземных гидрометеорологических наблюдений с сети станций гидрометслужбы, расположенных на суше (включая береговые станции). METAR – авиационный метеорологический код для передачи сводок о фактической погоде на аэродроме. Стоит отметить, что в кодах FM 12 SYNOP и METAR соблюдается строгий порядок следования информации. Многолетние метеорологические ряды являются детализированной информацией. При этом правильная обработка данных рядов позволит максимально точно описывать поведение природно- климатических показателей на рассматриваемой территории. ",
        "bbox": [
            114,
            619,
            880,
            739
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Международные коды FM 12 Synop и METAR имеют одинаковые показатели приборных измерений, а именно: скорость и направление ветра, температура воздуха, давление, влажность и отдельно качественная оценка общей облачности. Под функциональной зависимостью вида f(t) подразумевается значение показателя $f$ в момент времени t. Шаг изменения t в данной случае составляет один час. ",
        "bbox": [
            112,
            739,
            880,
            814
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Вектор приборных измерений $A _ { m } ^ { \\tau } \\left( t \\right)$ в момент времени t года τ расчетного периода, включающий качественную оценку общей облачности в процентах, имеет следующий вид: ",
        "bbox": [
            114,
            815,
            880,
            851
        ],
        "page_idx": 1
    },
    {
        "type": "equation",
        "text": "$$\nA _ {m} ^ {\\tau} (t) = \\left[ \\nu_ {\\text {w i n d}} (t), T _ {\\text {a i r}} (t), p _ {\\text {a i r}} (t), \\phi_ {\\%} (t), c (t) \\right]. \\tag {1}\n$$",
        "text_format": "latex",
        "bbox": [
            323,
            852,
            880,
            874
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "Стоит отметить, что код FM 12 Synop содержит более детальную информацию качественной оценки облачности, состава и высоты образования облаков, процент облаков ",
        "bbox": [
            114,
            875,
            880,
            906
        ],
        "page_idx": 1
    },
    {
        "type": "page_number",
        "text": "196 ",
        "bbox": [
            484,
            954,
            513,
            967
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "плохой погоды, облака нижнего яруса (слоисто-кучевые, слоистые, слоисто-дождевые, кучево- дождевые), облака среднего яруса (высококучевые, кучевые, высокослоистые), облака верхнего яруса (перистые, перисто-кучевые и перисто-слоистые облака). В международном коде METAR качественная оценка облачности послойно записана в вектор-столбце, что значительно усложняет их обработку за счет построчного сравнения эталонных (словесных) значений массива относительно каждого временного интервала τ-го года расчетного периода. ",
        "bbox": [
            114,
            85,
            882,
            175
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Вектор качественной оценки облачности $B _ { m } ^ { \\tau } ( \\mathfrak { t } )$ в момент времени t года τ расчетного периода для кода FM 12 Synop ",
        "bbox": [
            114,
            176,
            883,
            210
        ],
        "page_idx": 2
    },
    {
        "type": "equation",
        "text": "$$\nB ^ {\\tau} (t) = \\left[ C _ {l} (t), C _ {m} (t), C _ {h} (t), b _ {\\%} (t) \\right]. \\tag{2}\n$$",
        "text_format": "latex",
        "bbox": [
            360,
            211,
            878,
            232
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Матрица приборных измерений $A _ { m } ^ { \\tau } \\left( t \\right)$ и матрица качественной оценки облачности $B ^ { \\tau } \\left( t \\right)$ объединяются в единую матрицу природно-климатических показателей, где каждая строка есть вектор, характеризующий фактические значения параметров окружающей среды в определённый момент времени. Таким образом, полученная объединенная матрица описывает природно-климатические показатели с дискретным шагом один час. ",
        "bbox": [
            114,
            235,
            880,
            314
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Также используется информация об изменении вертикальной толщины озонового слоя, наличии капель воды и пара в облаках. Данные показатели находятся в свободном доступе в электронных архивах World Ozone and Ultraviolet Radiation Data Centre (WOURDC) и AErosol RObotic NETwork (AERONET). Отметим, что данные показатели необходимы для более точного определения актинометрических характеристик рассматриваемой территории. ",
        "bbox": [
            114,
            315,
            880,
            390
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "С подробным математическим описанием обработки многолетних метеорологических рядов с кодами FM 12 SYNOP и METAR их интеграции в системные энергетические исследования можно ознакомиться в [5]. На рисунке 1 показана блок-схема алгоритма работы математической модели актинометрических показателей. ",
        "bbox": [
            114,
            391,
            880,
            450
        ],
        "page_idx": 2
    },
    {
        "type": "image",
        "img_path": "images/705f21c1235683c893c00220a361900444a2cb9d118c51400a563013a4f8744b.jpg",
        "image_caption": [
            "Рисунок 1: Блок-схема математической модели Iqbal-Kasten/Czeplak "
        ],
        "image_footnote": [],
        "bbox": [
            117,
            451,
            878,
            764
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "4. Разработка WPS-сервиса расчета солнечной радиации ",
        "text_level": 1,
        "bbox": [
            114,
            802,
            713,
            821
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Алгоритмы для расчета показателей солнечной радиации написаны в программной среде MATLAB. Основные трудности использования этих алгоритмов заключаются в неудобстве вывода полученных показателей, а также низкой скорости их выполнения (примерно 40 минут) в зависимости от размерности исходного массива климатической информации и количества лет расчетного периода. ",
        "bbox": [
            114,
            838,
            880,
            914
        ],
        "page_idx": 2
    },
    {
        "type": "page_number",
        "text": "197 ",
        "bbox": [
            484,
            954,
            513,
            967
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Для решения данных проблем были реализованы сервис-ориентированные методы в виде WPS-сервиса (Web Processing Service). Схема работы WPS-сервиса представлена на рисунке 2. ",
        "bbox": [
            116,
            85,
            880,
            116
        ],
        "page_idx": 3
    },
    {
        "type": "image",
        "img_path": "images/bdede547fd172d4d578a9bd375c746a5856959599352ee9751af3667aadecbf8.jpg",
        "image_caption": [
            "Рисунок 2: Схема работы WPS-сервиса "
        ],
        "image_footnote": [],
        "bbox": [
            116,
            125,
            883,
            349
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Пользователь подает на вход в WPS-сервис параметры географической широты и долготы местности, по которым он планирует получить массивы актинометрических показателей. На основе подготовленных данных о фактической облачности, составу облаков, температуре воздуха, давлению, влажности и других параметров, которые были получены с ближайшей метеостанции, а также данных о номере расчетного года, проводится моделирование показателей суммарной солнечной радиации и ее составляющих, а именно: угол возвышения солнца над горизонтом, среднемесячные суммарная, прямая и рассеянная солнечные радиации, их среднечасовые показатели, а также среднегодовые значения. ",
        "bbox": [
            114,
            381,
            882,
            502
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Для этого были реализованы методы оценки облачности нижнего, среднего и верхнего уровней, метод расчета общего процента облачности и другие параметры. В результате получаются показатели суммы, представленные в формате строк, а временные ряды остальных показателей – в формате CSV. ",
        "bbox": [
            114,
            510,
            880,
            572
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "WPS-сервис был разработан при помощи языка программирования Python. Для реализации расчетной части были применены библиотеки numpy и scipy. Для создания непосредственно самого WPS-сервиса были использованы такие библиотеки, как pywps и os, а тестирование происходило при помощи pywps-flask. ",
        "bbox": [
            114,
            580,
            880,
            642
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "В результате написания WPS-сервиса были решены ряд задач с выводом полученных показателей солнечной радиации в удобный для представления формате, а также сокращение времени выполнения алгоритмов до 2 минут. На рисунке 3 показаны результаты моделирования солнечной радиации за 10 лет расчетного периода для территории западной Сибири с 2013 по 2023 годы. ",
        "bbox": [
            114,
            650,
            880,
            726
        ],
        "page_idx": 3
    },
    {
        "type": "page_number",
        "text": "198 ",
        "bbox": [
            484,
            954,
            513,
            967
        ],
        "page_idx": 3
    },
    {
        "type": "image",
        "img_path": "images/904928eb9d73e5a5b668dcfbad5bffb714472245119e84165807beef16f51274.jpg",
        "image_caption": [],
        "image_footnote": [],
        "bbox": [
            200,
            81,
            489,
            271
        ],
        "page_idx": 4
    },
    {
        "type": "image",
        "img_path": "images/b40fe766c6e668cc44d3a093a479915815f595f3577ce51858c6f466e8272b1b.jpg",
        "image_caption": [],
        "image_footnote": [],
        "bbox": [
            516,
            81,
            803,
            274
        ],
        "page_idx": 4
    },
    {
        "type": "image",
        "img_path": "images/58de0697b559e27f0316e9550cd7c30de2daadc17813b1968e940a641f2f8977.jpg",
        "image_caption": [
            "Рисунок 3: Результаты моделирования солнечной радиации для территории западной Сибири "
        ],
        "image_footnote": [],
        "bbox": [
            351,
            276,
            636,
            466
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "Результаты, полученные при использовании WPS-сервиса, имеют характерный вид для рассматриваемого региона с максимальными значениями в весенне-летний периоды. ",
        "bbox": [
            114,
            505,
            880,
            536
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "5. Заключение ",
        "text_level": 1,
        "bbox": [
            114,
            553,
            277,
            568
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "В рамках данной статьи были представлены изначальная постановка исследования, математическая модель Iqbal-Kasten/Czeplak и алгоритмы, реализующие их в виде WPSсервиса открытого доступа для моделирования солнечной радиации по ретроспективным данным для рассматриваемых локаций. ",
        "bbox": [
            114,
            589,
            880,
            650
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "Использование библиотек numpy, scipy, pywps, os, pywps-flask позволило наиболее эффективно реализовать основные алгоритмы, описывающие работу математической модели солнечной радиации. ",
        "bbox": [
            114,
            657,
            880,
            705
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "Дальнейшие исследования будут посвящены развитию реализованных моделей и алгоритмов, а также решение следующих задач: ",
        "bbox": [
            114,
            713,
            880,
            743
        ],
        "page_idx": 4
    },
    {
        "type": "list",
        "sub_type": "text",
        "list_items": [
            "уменьшение времени работы алгоритмов для вычисления показателей солнечной радиации путем оптимизации методов расчета и алгоритмов. ",
            "Формирование блока выявления аномальных значений, а также заполнение отсутствующих данных за счет использования методов искусственного интеллекта и других средств в этой области. ",
            " внедрение разработанного сервиса в геопортал ИДСТУ СО РАН. "
        ],
        "bbox": [
            114,
            752,
            880,
            865
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "6. Благодарности ",
        "text_level": 1,
        "bbox": [
            114,
            883,
            306,
            900
        ],
        "page_idx": 4
    },
    {
        "type": "page_number",
        "text": "199 ",
        "bbox": [
            484,
            954,
            513,
            967
        ],
        "page_idx": 4
    },
    {
        "type": "text",
        "text": "Работа выполнена в рамках гранта № 075-15-2024-533 Министерства науки и высшего образования РФ на выполнение крупного научного проекта по приоритетным направлениям научно-технологического развития (проект «Фундаментальные исследования Байкальской природной территории на основе системы взаимосвязанных базовых методов, моделей, нейронных сетей и цифровой платформы экологического мониторинга окружающей среды», , рег. № 124052100088-3). ",
        "bbox": [
            114,
            84,
            882,
            175
        ],
        "page_idx": 5
    },
    {
        "type": "text",
        "text": "7. Список источников ",
        "text_level": 1,
        "bbox": [
            116,
            194,
            346,
            209
        ],
        "page_idx": 5
    },
    {
        "type": "list",
        "sub_type": "ref_text",
        "list_items": [
            "[1] Лукутин, Б. В. Оптимизация энергетических балансов фотоэлектрической станции с электрохимическим и тепловым аккумулированием солнечной энергии / Б. В. Лукутин, А. М. Каррар Хамид // Известия высших учебных заведений. Проблемы энергетики. – 2022. – Т. 24, № 2. – С. 3-13. ",
            "[2] Лукутин, Б. В. Критерии вовлечения ВИЭ в повышение энергетической безопасности изолированных труднодоступных территорий Севера и Арктической зоны РФ / Б. В. Лукутин, В. Р. Киушкина, И. С. Иванов // Журнал Сибирского федерального университета. Серия: Техника и технологии. – 2021. – Т. 14, № 5. – С. 507-519. ",
            "[3] L.T. Wong, W.K. Chow. Solar radiation model / L.T. Wong // Applied Energy. – 2001. – V. 69. – P. 191-224. ",
            "[4] Карамов, Д. Н. Формирование исходных метеорологичеcких массивов с использованием многолетних рядов FM 12 Synop и METAR в системных энергетических исследованиях / Д. Н. Карамов // Известия Томского политехнического университета. Инжиниринг георесурсов. – 2018. – Т. 329, № 1. – С. 69-88. ",
            "[5] Карамов, Д. Н. Математическое моделирование солнечной радиации с использованием многолетних метеорологических рядов, находящихся в открытом доступе / Д. Н. Карамов // Известия Томского политехнического университета. Инжиниринг георесурсов. – 2017. – Т. 328, № 6. – С. 28-37. "
        ],
        "bbox": [
            117,
            226,
            882,
            498
        ],
        "page_idx": 5
    },
    {
        "type": "page_number",
        "text": "200 ",
        "bbox": [
            483,
            954,
            513,
            967
        ],
        "page_idx": 5
    }
]